
#include <iostream>
#include <vector>
#include <numeric> 
using namespace std;
//#define __cplusplus 199711L //98 стандарт с++
//#define __cplusplus 201103L //11 стандарт с++
class MyClass
{
public:
    MyClass();
    ~MyClass();

private:

};

MyClass::MyClass()
{
}

MyClass::~MyClass()
{
}

int main()
{
//Стандарт с++98 и с++11 и выше имеет ряд особенностей, которые стоит учитывать, если необходимо переводить код с одного стандарта на другой(например с более низкого на более высокий)
//например, стоит задача перевода кода с++98 на с++11(например)
//Тогда есть ряд особенностей(приведем вместе с вариацией кода):
///////////////////////////////////////////////////////////////////////////////////////////////////////////// 
    //В с++11 есть возможность использовать auto
     int a = 5;
     double b = 4.2;
#if __cplusplus == 201103L
    double result = a + b;  
#elif __cplusplus == 201103L
    auto result = a + b; 
#endif
///////////////////////////////////////////////////////////////////////////////////////////////////////////// 
    //В с++11 есть возможность использовать std::unique_ptr вместо обычного указателя
    std::unique_ptr<MyClass> ptr(new MyClass());
///////////////////////////////////////////////////////////////////////////////////////////////////////////// 
    //В с++11 есть возможность использовать лямбда-функцию
    std::vector<int> numbers = { 1, 2, 3 };
    int sum = std::accumulate(numbers.begin(), numbers.end(), 0,
        [](int acc, int num) {
            return (num % 2 == 0) ? acc + num : acc;
        });
///////////////////////////////////////////////////////////////////////////////////////////////////////////// 
    //В с++98 использовался NULL для нулевого указателя, для стандарта выше необходимо использовать nullptr
#if __cplusplus == 201103L
    int* p = NULL;
#elif __cplusplus == 201103L
    int* p = nullptr; // Использование nullptr вместо NULL
#endif
///////////////////////////////////////////////////////////////////////////////////////////////////////////// 
    //В с++11 есть возможность использовать std::unordered_map вместо std::map там где не важна сортировка(ускоряет работу программы)
#if __cplusplus == 201103L
    std::map<int, int> map;
#elif __cplusplus == 201103L
    std::unordered_map<int, int> map; // Контейнер unordered_map
#endif
/////////////////////////////////////////////////////////////////////////////////////////////////////////////     
//Программно можно узнать стандарт таким образом как написано ниже
#if __cplusplus == 201103L
    std::cout << "C++11\n";
#elif __cplusplus == 201103L
    std::cout << "C++98\n";
#elif __cplusplus == 201402L
    std::cout << "C++14\n";
#elif __cplusplus == 201703L
    std::cout << "C++17\n";
#elif __cplusplus == 202002L
    std::cout << "C++20\n";
#elif __cplusplus == 202311L
    std::cout << "C++23\n";
#else
    std::cout << "Older standard or unknown standard\n";

#endif
	return 0;
}
